app/controllers/photos_controller.rb

  def create
    @photo = Photo.new(photo_params)

    respond_to do |format|
      if @photo.save
---
INSERT INTO "photos" ("created_at", "photo_content_type", "photo_file_name", "photo_file_size", "photo_updated_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @photo.update(photo_params)
---
UPDATE "photos" SET "photo_file_name" = ?, "photo_file_size" = ?, "photo_updated_at" = ?, "updated_at" = ? WHERE "photos"."id" = 1  [["photo_file_name", "1.JPG"], ["photo_file_size", 217658], ["photo_updated_at", Fri, 13 Sep 2013 18:52:45 UTC +00:00], ["updated_at", Fri, 13 Sep 2013 18:52:46 UTC +00:00]]

    def set_photo
      @photo = Photo.find(params[:id])
---
SELECT "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT 1  [["id", "1"]]